Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: The horse had fallen to the ~ CTRL-U fallen to the ~
es_es: El caballo cayó del cielo ~ CTRL-W cayó del ~

source: When you spot a mistake a few words back, you need to move the cursor there to correct it. For example, you typed this:
es_es: Cuando detecta un error en alguna palabra anterior, necesita desplazar el cursor hasta ese punto para corregirlo. Por ejemplo, escribió lo siguiente:

source: The horse had follen to the ground ~
es_es: El caballo cayu al suelo ~

source: You need to change "follen" to "fallen". With the cursor at the end, you would type this to correct it: >
es_es: Necesita cambiar «cayo» a «cayó». Con el cursor al final, teclearía esto para corregirlo: >

source: <Esc>4blraA
es_es: <Esc>3blróA

source: < get out of Insert mode <Esc> four words back 4b move on top of the "o" l replace with "a" ra restart Insert mode A
es_es: < Abandonar el modo insertar <Esc> Cuatro palabras hacia atrás 3b Desplazarse a la «u» l Reemplazar con «ó» ró Reiniciar modo insertar A

source: Another way to do this: >
es_es: Existe otra manera de hacer esto: >

source: <C-Left><C-Left><C-Left><C-Left><Right><Del>a<End>
es_es: <C-Izq><C-Izq><C-Izq><Derecha><Derecha><Derecha><Supr>ó<Fin>

source: < four words back <C-Left><C-Left><C-Left><C-Left> move on top of the "o" <Right> delete the "o" <Del> insert an "a" a go to end of the line <End>
es_es: < Tres palabras hacia atrás <C-Izq><C-Izq><C-Izq> Desplazarse a la «u» <Derecha><Derecha><Derecha> Borrar la «u» <Supr> Insertar una «ó» ó Ir al final de la línea <Fin>

source: This uses special keys to move around, while remaining in Insert mode. This resembles what you would do in a modeless editor. It's easier to remember, but takes more time (you have to move your hand from the letters to the cursor keys, and the <End> key is hard to press without looking at the keyboard). These special keys are most useful when writing a mapping that doesn't leave Insert mode. The extra typing doesn't matter then. An overview of the keys you can use in Insert mode:
es_es: Esto emplea teclas especiales para el desplazamiento, a la vez que permanece en el modo Insertar. Esto se parece a lo que haría con un editor sin modos. Es más fácil de recordar, pero lleva más tiempo (tiene que mover sus manos de las letras a las teclas del cursor, y es difícil pulsar la tecla <Fin> sin mirar el teclado). Estas teclas especiales son más útiles cuando escribe una macro que no abandona el modo Insertar. El tecleo adicional no importa en este caso. Este es un resumen de las teclas que puede usar en el modo Insertar:

source: <C-Home> to start of the file <PageUp> a whole screenful up <Home> to start of line <S-Left> one word left <C-Left> one word left <S-Right> one word right <C-Right> one word right <End> to end of the line <PageDown> a whole screenful down <C-End> to end of the file
es_es: <C-Inicio> al principio del archivo <Repág> subir una pantalla <Inicio> al inicio de la línea <S-Izq> una palabra a la izquierda <C-Izq> una palabra a la izquierda <S-Der> una palabra a la derecha <C-Der> una palabra a la derecha <Fin> al final de la línea <Avpág> bajar una pantalla <C-Fin> al final del archivo

source: *24.2* Showing matches
es_es: *24.2* Mostrar coincidencias

source: When you type a ) it would be nice to see with which ( it matches. To make Vim do that use this command: >
es_es: Al teclear una «)» estaría bien ver con qué «(» encaja. Para hacer que Vim use esta orden: >

source: When you now type a text like "(example)", as soon as you type the ) Vim will briefly move the cursor to the matching (, keep it there for half a second, and move back to where you were typing. In case there is no matching (, Vim will beep. Then you know that you might have forgotten the ( somewhere, or typed a ) too many. The match will also be shown for [] and {} pairs. You don't have to wait with typing the next character, as soon as Vim sees it the cursor will move back and inserting continues as before. You can change the time Vim waits with the 'matchtime' option. For example, to make Vim wait one and a half second: >
es_es: Ahora, cuando teclee un texto como «(ejemplo), tan pronto como teclee el «)» Vim moverá el cursor brevemente al «(» correspondiente, lo mantendrá ahí medio segundo, y volverá a donde estaba tecleando. En caso de no existir un correspondiente «(», Vim pitará. Sabrá entonces que ha olvidado el «(» en algún lugar, o que escribió una «)» demasiadas veces. También se mostrará el signo correspondiente en las parejas «[]» «{}». No tiene que esperar a teclear el siguiente carácter, ya que tan pronto como Vim lo detecte, devolverá el cursor a su posición original, continuando la inserción. Puede modificar el tiempo que Vim espera con la opción 'matchtime'. Por ejemplo, para hacer que Vim espere un segundo y medio: >

source: *24.3* Completion
es_es: *24.3* Autocompletado

source: Vim can automatically complete words on insertion. You type the first part of a word, press CTRL-P, and Vim guesses the rest. Suppose, for example, that you are creating a C program and want to type in the following:
es_es: Vim puede auto-completar palabras durante la inserción. Escriba primero la parte inicial de una palabra, pulse CTRL-P y Vim adivinará el resto. Suponga, por ejemplo, que está creando un programa en C y que desea teclear lo siguiente:

source: At this point, you tell Vim to complete the word using the command CTRL-P. Vim searches for a word that starts with what's in front of the cursor. In this case, it is "ch_", which matches with the word ch_array. So typing CTRL-P gives you the following:
es_es: En este punto es cuando le dice a Vim que complete la palabra usando la orden CTRL-P. Vim buscará una palabra que empiece con lo que se aparece frente al cursor. En este caso, es «ch_», el cual encaja con la palabra «ch_array». Por ello, teclear CTRL-P le daría lo siguiente:

source: If you now type CTRL-P Vim will search again for a word that completes the word before the cursor. Since there is nothing in front of the cursor, it finds the first word backwards, which is "ch_array". Typing CTRL-P again gives you the next word that matches, in this case "total". A third CTRL-P searches further back. If there is nothing else, it causes the editor to run out of words, so it returns to the original text, which is nothing. A fourth CTRL-P causes the editor to start over again with "ch_array".
es_es: Si pulsa ahora CTRL-P, Vim buscará otra vez una palabra que complete la que se haya frente al cursor. Ya que no hay nada en frente del cursor, busca la palabra en sentido inverso, el cual es «ch_array». Pulsar CTRL-P otra vez le daría la siguiente palabra que encaja, en este caso «total». Si lo pulsa por tercera vez, Vim buscará aún más atrás. Si no hay nada más, al editor se le acabarían las palabras, volviendo al texto original, que es nada. Un cuarto CTRL-P causaría al editor empezar otra vez con «ch_array».

source: To search forward, use CTRL-N. Since the search wraps around the end of the file, CTRL-N and CTRL-P will find the same matches, but in a different sequence. Hint: CTRL-N is Next-match and CTRL-P is Previous-match.
es_es: Use CTRL-N para una búsqueda hacia delante. Ya que la búsqueda vuelve al inicio cuando llega al final del archivo, CTRL-N y CTRL-P encontrarán las mismas coincidencias, pero en distinto orden. Pista: CTRL-N es siguiente coincidencia («Next-match») y CTRL-P es la coincidencia anterior («Previous-match»).

source: The Vim editor goes through a lot of effort to find words to complete. By default, it searches the following places:
es_es: Vim realiza un gran esfuerzo por encontrar palabras que completar. Por omisión, busca en los siguientes lugares:

source: 1. Current file 2. Files in other windows 3. Other loaded files (hidden buffers) 4. Files which are not loaded (inactive buffers) 5. Tag files 6. All files #included by the current file
es_es: 1. Archivo actual 2. Archivos en otras ventanas 3. Otros archivos cargados (búfers ocultos) 4. Archivos que no están cargados (búfers inactivos) 5. Archivos de etiquetas 6. Todos los archivos #incluidos en el archivo actual

source: The 'ignorecase' option is used. When it is set, case differences are ignored when searching for matches.
es_es: La opción 'ignorecase' es empleada. Las diferencias entre mayúsculas y minúsculas se ignorarán al buscar coincidencias de activar esta opción.

source: A special option for completion is 'infercase'. This is useful to find matches while ignoring case ('ignorecase' must be set) but still using the case of the word typed so far. Thus if you type "For" and Vim finds a match "fortunately", it will result in "Fortunately".
es_es: 'infercase' es una opción especial para el autocompletado. Es útil para encontrar parejas cuando ignora la sensibilidad a mayúsculas y minúsculas (debe activar 'ignorecase') , y seguir usando con esta palabra la mencionada sensibilidad. Por ello, si teclea «Para» y Vim encuentra «paramilitar», el resultado final será «Paramilitar».

source: CTRL-X CTRL-F file names CTRL-X CTRL-L whole lines CTRL-X CTRL-D macro definitions (also in included files) CTRL-X CTRL-I current and included files CTRL-X CTRL-K words from a dictionary CTRL-X CTRL-T words from a thesaurus CTRL-X CTRL-] tags CTRL-X CTRL-V Vim command line
es_es: CTRL-X CTRL-F Nombres de archivo CTRL-X CTRL-L Líneas completas CTRL-X CTRL-D Definiciones de macros (también en archivos incluidos) CTRL-X CTRL-I Archivo actual e incluidos CTRL-X CTRL-K Palabras de un diccionario CTRL-X CTRL-T Palabras de un tesauro CTRL-X CTRL-] Etiquetas CTRL-X CTRL-V Línea de órdenes de Vim

source: After each of them CTRL-N can be used to find the next match, CTRL-P to find the previous match. More information for each of these commands here: |ins-completion|.
es_es: Puede usar CTRL-N después de cada uno de estas órdenes para hallar la siguiente coincidencia, y CTRL-P para hallar la anterior. Para más información acerca de estas órdenes, consulte |ins-completion|.

source: Let's take CTRL-X CTRL-F as an example. This will find file names. It scans the current directory for files and displays each one that matches the word in front of the cursor. Suppose, for example, that you have the following files in the current directory:
es_es: Tomemos CTRL-X CTRL-F como ejemplo. Esto busca nombres de archivo. Examina el directorio actual en busca de archivos, y muestra cada uno que encaja con la palabra frenet al cursor. Suponga, por ejemplo, que tiene las siguientes líneas en el directorio actual:

source: The exit code is in the file sub ~
es_es: El código de salida está en el archivo sub ~

source: At this point, you enter the command CTRL-X CTRL-F. Vim now completes the current word "sub" by looking at the files in the current directory. The first match is sub_count.c. This is not the one you want, so you match the next file by typing CTRL-N. This match is sub_done.c. Typing CTRL-N again takes you to sub_exit.c. The results:
es_es: En este momento, introduzca la orden CTRL-X CTRL-F. Vim completará la palabra «sub» mirando en los ficheros en el directorio actual. La primera coincidencia es «sub_count.c». Esto no es lo que buscaba, así que busca la siguiente pareja pulsando CTRL-N. La coincidencia es «sub_done.c». Teclear CTRL-N otra vez le devolvería a «sub_exit.c». El resultado:

source: The exit code is in the file sub_exit.c ~
es_es: El código de salida está en el archivo sub_exit.c ~

source: If the file name starts with / (Unix) or C:\ (MS-Windows) you can find all files in the file system. For example, type "/u" and CTRL-X CTRL-F. This will match "/usr" (this is on Unix):
es_es: Si el nombre de archivo empieza con «/» (Unix) o «C:\» (MS-Windows), puede buscar todos los archivos en el sistema de archivos. Por ejemplo, teclee «/u» y CTRL-X CTRL-F. Esto buscará «/usr» (en Unix):

source: the file is found in /usr/ ~
es_es: El archivo se encuentra en "/usr/" ~

source: If you now press CTRL-N you go back to "/u". Instead, to accept the "/usr/" and go one directory level deeper, use CTRL-X CTRL-F again:
es_es: Si ahora pulsa CTRL-N volvería a «/u». En lugar de ello, para aceptar «/usr/» y descender un nivel en el árbol de directorios, use otra vez CTRL-X CTRL-F:

source: the file is found in /usr/X11R6/ ~
es_es: El archivo se encuentra en /usr/X11R6/~

source: The results depend on what is found in your file system, of course. The matches are sorted alphabetically.
es_es: Los resultados varían según lo que se encuentra en su sistema de archivos. Las coincidencias aparecen alfabéticamente.

source: Source code files are well structured. That makes it possible to do completion in an intelligent way. In Vim this is called Omni completion. In some other editors it's called intellisense, but that is a trademark.
es_es: Los archivos de código están bien estructurados. Esto posibilita un autocompletado inteligente. En Vim, esto se llama autocompletado global («Omni completion»). Algunos otros editores lo llaman intellisense, pero eso es una marca.

source: The key to Omni completion is CTRL-X CTRL-O. Obviously the O stands for Omni here, so that you can remember it easier. Let's use an example for editing C source:
es_es: La tecla para el autocompletado global es CTRL-X CTRL-O. Obviamente, la «O» significa «Omni», para recordarla mejor. Usemos un ejemplo para editar código C:

source: The cursor is after "p->". Now type CTRL-X CTRL-O. Vim will offer you a list of alternatives, which are the items that "struct foo" contains. That is quite different from using CTRL-P, which would complete any word, while only members of "struct foo" are valid here.
es_es: El cursor está después de «p->». Pulse ahora CTRL-X CTRL-O. Vim le ofrecerá una lista de alternativas, los cuales son los elementos que contiene «struct foo». Esto es diferente al uso de CTRL-P, el cual completa cualquier palabra, mientras que aquí sólo son válidos los miembros de «struct foo».

source: For Omni completion to work you may need to do some setup. At least make sure filetype plugins are enabled. Your vimrc file should contain a line like this: > filetype plugin on Or: > filetype plugin indent on
es_es: Necesita realizar alguna configuración para que funcione el autocompletado global. Asegúrese al menos de que las extensiones de tipo de archivo (filetype) están activadas. El archivo vimrc debería tener esta línea: > filetype plugin on O: > filetype plugin indent on

source: For C code you need to create a tags file and set the 'tags' option. That is explained |ft-c-omni|. For other filetypes you may need to do something similar, look below |compl-omni-filetypes|. It only works for specific filetypes. Check the value of the 'omnifunc' option to find out if it would work.
es_es: Necesita crear un archivo de etiquetas y definir la opción 'tags' si desea editar código C. Consulte |ft-c-omni|. Puede que tenga que realizar algo similar para otros tipos de archivo, consulte más adelante |compl-omni-filetypes|. Sólo funciona para ciertos tipos de archivo. Revise el valor de la opción 'omnifunc' para ver si funcionaría.

source: *24.4* Repeating an insert
es_es: *24.4* Repetir una inserción

source: If you press CTRL-A, the editor inserts the text you typed the last time you were in Insert mode. Assume, for example, that you have a file that begins with the following:
es_es: Si pulsa CTRL-A, el editor insertará el texto que tecleó la última que estaba en el modo Insertar. Suponga, por ejemplo, que tiene un archivo que empieza con lo siguiente:

source: "file.h" ~ /* Main program begins */ ~
es_es: "file.h" ~ /* El programa principal comienza */ ~

source: #include "file.h" ~ /* Main program begins */ ~
es_es: #include "file.h" ~ /* El programa principal comienza */ ~

source: You go down to the beginning of the next line using the commands "j^". You now start to insert a new "#include" line. So you type: >
es_es: Puede bajar hasta el inicio de la siguiente línea con las órdenes «j^». Ahora puede empezar a insertar una nueva línea «include». Asi que escribe: >

source: The result is as follows:
es_es: El resultado es el siguiente:

source: #include "file.h" ~ #include /* Main program begins */ ~
es_es: #include "file.h" ~ #include /* El programa principal comienza */ ~

source: The "#include " was inserted because CTRL-A inserts the text of the previous insert. Now you type "main.h"<Enter> to finish the line:
es_es: «#include» se insertó porque CTRL-A inserta el texto de la inserción anterior. Teclee ahora «main.h» <Enter> para finalizar la línea:

source: #include "file.h" ~ #include "main.h" ~ /* Main program begins */ ~
es_es: #include "file.h" ~ #include "main.h" ~ /* El programa principal comienza */ ~

source: The CTRL-@ command does a CTRL-A and then exits Insert mode. That's a quick way of doing exactly the same insertion again.
es_es: La orden CTRL-@ realiza un CTRL-A y abandona el modo Insertar. Esta es una manera rápida de hacer la misma inserción otra vez.

source: *24.5* Copying from another line
es_es: *24.5* Copiar desde otra línea

source: The CTRL-Y command inserts the character above the cursor. This is useful when you are duplicating a previous line. For example, you have this line of C code:
es_es: La orden CTRL-Y inserta el carácter sobre el cursor. Esto es útil si está duplicando una línea anterior. Por ejemplo, tiene esta línea de código C:

source: Now you need to type the same line, but with "s_prev" instead of "s_next". Start the new line, and press CTRL-Y 14 times, until you are at the "n" of "next":
es_es: Ahora necesita escribir la misma línea, pero con un «s_prev» en lugar de «s_next». Inicie una nueva línea, y pulse CTRL-Y 14 veces, hasta encontrarse en la «n» de «next»:

source: *24.6* Inserting a register
es_es: *24.6* Insertar un registro

source: The command CTRL-R {register} inserts the contents of the register. This is useful to avoid having to type a long word. For example, you need to type this:
es_es: La orden CTRL-R {registro} inserta el contenido de un registro. Esto es útil para evitar escribir una palabra larga. Por ejemplo, necesita teclear esto:

source: r = VeryLongFunction(a) + VeryLongFunction(b) + VeryLongFunction(c) ~
es_es: r = FunciónMuyLarga(a) + FunciónMuyLarga(b) + FunciónMuyLarga(c) ~

source: The function name is defined in a different file. Edit that file and move the cursor on top of the function name there, and yank it into register v: >
es_es: El nombre de la función se define en otro archivo. Edite ese archivo y desplace el cursor sobre el nombre de función presente, y copie el mismo al registro v:

source: "v is the register specification, "yiw" is yank-inner-word. Now edit the file where the new line is to be inserted, and type the first letters:
es_es: «"v» es el especificador del registro, «yiw» signifia copiar la palabra interior («yank inner word»). Edite ahora el archivo donde se insertará la línea, y escriba las primeras letras:

source: r = VeryLongFunction ~
es_es: r = FunciónMuyLarga ~

source: You continue to type the characters in between the function name, and use CTRL-R v two times more. You could have done the same with completion. Using a register is useful when there are many words that start with the same characters.
es_es: Continua insertando caracteres en medio del nombre de la función, y usa «CTRL-R v» dos veces más. Podría haber realizado lo mismo con el autocompletado. Usar un registro es útil cuando hay varias palabras que empiezan con el mismo carácter.

source: If the register contains characters such as <BS> or other special characters, they are interpreted as if they had been typed from the keyboard. If you do not want this to happen (you really want the <BS> to be inserted in the text), use the command CTRL-R CTRL-R {register}.
es_es: Si el registro contiene caracteres tales como <BS> o otros caracteres especiales, se interpretarán como introducidos a través del teclado. Si no desea que esto ocurra (realmente quiere que <BS> acabe insertado en el texto), use la orden CTRL-R CTRL-R {registro}.

source: *24.7* Abbreviations
es_es: *24.7* Abreviaturas

source: An abbreviation is a short word that takes the place of a long one. For example, "ad" stands for "advertisement". Vim enables you to type an abbreviation and then will automatically expand it for you. To tell Vim to expand "ad" into "advertisement" every time you insert it, use the following command: >
es_es: Una abreviatura es una palabra corta que sustituye a otra más larga. Por ejemplo, «poli» simboliza «policía». Vim le permite insertar una abreviatura para después expandirla automáticamente. Para decir a Vim que expanda «poli» a «policía» cada vez que lo inserte, use la siguiente orden: >

source: :iabbrev ad advertisement
es_es: :iabbrev poli policía

source: Now, when you type "ad", the whole word "advertisement" will be inserted into the text. This is triggered by typing a character that can't be part of a word, for example a space:
es_es: Ahora, cuando escribe «po», aparecerá la palabra completa «policía» en el texto. Esto se activa cuando teclea un carácter que no puede ser parte de una palabra, como por ejemplo un espacio:

source: What Is Entered What You See I saw the a I saw the a ~ I saw the ad I saw the ad ~ I saw the ad<Space> I saw the advertisement<Space> ~
es_es: Texto introducido Lo que ve Vi al p Vi al p ~ Vi al po Vi al po ~ Vi al po<Espacio> Vi al policía<Espacio> ~

source: The expansion doesn't happen when typing just "ad". That allows you to type a word like "add", which will not get expanded. Only whole words are checked for abbreviations.
es_es: La expansión no ocurre si solo escribe «po». Esto permite escribir una palabra como «polifacético», que no se expandirá. Solo se revisan palabras completas con abreviaturas.

source: It is possible to define an abbreviation that results in multiple words. For example, to define "JB" as "Jack Benny", use the following command: >
es_es: Es posible definir una abreviatura cuyo resultado sean varias palabras. Por ejemplo, para definir «JB» como «Juan Benítez», use la siguiente orden: >

source: :iabbrev JB Jack Benny
es_es: :iabbrev JB Juan Benítez

source: These are used for creating boxed comments. The comment starts with #b, which draws the top line. I then type the comment text and use #e to draw the bottom line. Notice that the #e abbreviation begins with a space. In other words, the first two characters are space-star. Usually Vim ignores spaces between the abbreviation and the expansion. To avoid that problem, I spell space as seven characters: <, S, p, a, c, e, >.
es_es: Uso esto para crear comentarios en cajas. El comentario empieza con «#b», el cual escribe la línea superior. Después escribo el texto del comentario y uso «#e» para dibujar la línea inferior. Observe que la abreviatura «#e» empieza con un espacio. En otras palabras, los primeros dos caracteres son espacio-asterisco. Por lo general, Vim ignora los espacios entre la abreviatura y la expansión. Para evitar tal problema, deletreo espacio («space») como siete caracters: <, S, p, a, c, e,>.

source: Note: ":iabbrev" is a long word to type. ":iab" works just as well. That's abbreviating the abbreviate command!
es_es: Nota: La palabra «:iabbrev» es algo larga. «:iab» también daría resultado. ¡Esto es abreviar la orden de abreviar!

source: It's very common to make the same typing mistake every time. For example, typing "teh" instead of "the". You can fix this with an abbreviation: >
es_es: Es bastante normal escribir siempre el mismo error. Por ejemplo, escribir «qeu» en lugar de «que». Puede arreglar esto con una abreviatura: >

source: :abbreviate teh the
es_es: :abbreviate qeu que
